# ShowRoomBoundingElements Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..ShowRoomBoundingElements Property
BuiltInFailures..::..RoomFailures Class See Also
---
[Room] Bounding elements are highlighted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ShowRoomBoundingElements { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ShowRoomBoundingElements As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ShowRoomBoundingElements {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace